In [1]:
#--------------------Pandas Series-------------#
# Pandas allows for fast analysis and ddata cleaning and preparation.
#It also has built-in visualization features

In [1]:
import numpy as np

In [2]:
# import pandas library
import pandas as pd

In [5]:
#two list taken here
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [10]:
#Create a Series by pandas
#First paremeter of a Series a data and second is Index
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
#specified user define index
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [13]:
#we make array to series
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [14]:
#dectionay to series
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [15]:
# label to Series
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [16]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])

In [17]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2=pd.Series([1,2,5,3],['USA','Germany','Italy','Japan'])

In [19]:
ser2

USA        1
Germany    2
Italy      5
Japan      3
dtype: int64

In [21]:
#value of Italy Index
ser2['Italy']

5

In [22]:
# summation of two series
ser1+ser2

Germany    4.0
Italy      NaN
Japan      7.0
USA        2.0
USSR       NaN
dtype: float64

In [23]:
#--------------------Pandas- DataFrames-------------#
#DataFram(data=None,index=None,columns=None,dtype=None,...)

In [1]:
#import random number generator library
from numpy.random import randn

In [5]:
np.random.seed(101)

In [7]:
df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [8]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [9]:
# W colum value
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [10]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [11]:
# more then one Colum value
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [12]:
#for added new colum
df['new']=df['W']+df['Y']

In [13]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [17]:
#reomve for colum
df.drop('new',axis=1,inplace=True)

In [18]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [19]:
#remove row
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [20]:
# To access row
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [21]:
# To access specipic index location row
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

In [22]:
# To access index of a sell
df.loc['B','Y']

0.16690463609281317

In [23]:
# Subset of a dataframe
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [24]:
#--------------DataFrames Part2----------------#

In [25]:
#compare DataFrame
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [26]:
# we can also store a variable
booldf=df>0

In [27]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [28]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [29]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [30]:
#To compare a colum
df['W']>0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [31]:
# row contains wher W is greater then zero
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [35]:
# Condition to get a specipic row
df[df['W']>0][['X','Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [37]:
# and operation
df[(df['W']>0) & (df['Y']<1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [39]:
# Or operation
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [40]:
#Reset Index and Set Index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [41]:
newind='CA NY WY OR CO'.split()

In [42]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [43]:
df['States']=newind

In [44]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [45]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [46]:
#-----------DataFrames Part 3---------#
# MultiIndex

In [47]:
outside=['G1','G1','G1','G2','G2','G2']

In [48]:
inside=[1,2,3,1,2,3]

In [49]:
hier_index=list(zip(outside,inside))

In [50]:
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [51]:
df=pd.DataFrame(randn(6,2),hier_index)

In [53]:
df

             0         1
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [54]:
df.loc['G1']

          0         1
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [55]:
df.index.names=['Groups','Num']

In [56]:
df

                   0         1
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [58]:
#Access sell
df.loc['G2'].loc[2][1]

-0.6102588558227414

In [1]:
#-------------------Missing Data-------------#

In [7]:
#Create a Dataframe
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [8]:
df=pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [10]:
#remove missing values which row contains NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [12]:
#remove missing rows which row contains at least 2 NaN
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [13]:
#fill nan value to mean
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [14]:
#--------------Groupby-----------#

In [16]:
data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Any','Varnessa','Carl','Saran'],
      'Sales':[200,120,340,124,243,350]
     }

In [18]:
df=pd.DataFrame(data)

In [19]:
df

  Company    Person  Sales
0    GOOG       Sam    200
1    GOOG   Charlie    120
2    MSFT       Any    340
3    MSFT  Varnessa    124
4      FB      Carl    243
5      FB     Saran    350

In [21]:
byCompany=df.groupby('Company')

In [22]:
#mean value of each group
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
#sum of each group

In [24]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [25]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [26]:
#Max value of group by

In [27]:
df.groupby('Company').max()

           Person  Sales
Company
FB          Saran    350
GOOG          Sam    200
MSFT     Varnessa    340

In [29]:
#min value of group by
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Any    124

In [30]:
#Describe method

In [31]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [33]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [34]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [43]:
#------------------Marging joing and Concatenating----------#

df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                'B':['B0','B1','B2','B3'],
                'C':['C0','C1','C2','C3']},
                 index=[0,1,2,3])

In [39]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3

In [40]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                'B':['B4','B5','B6','B7'],
                'C':['C4','C5','C6','C7']},
                 index=[4,5,6,7])

In [41]:
df2

    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7

In [42]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],
                'B':['B8','B9','B10','B11'],
                'C':['C8','C9','C10','C11']},
                 index=[8,9,10,11])

In [45]:
pd.concat([df1,df2,df3])

      A    B    C
0    A0   B0   C0
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11

In [46]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    A    B    C    A    B    C
0    A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11

In [47]:
#.....Merging....#

In [49]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

In [51]:
right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']})

In [52]:
pd.merge(left,right,how='inner',on='key')

  key C_x D_x C_y D_y
0  K0  C0  D0  C0  D0
1  K1  C1  D1  C1  D1
2  K2  C2  D2  C2  D2
3  K3  C3  D3  C3  D3

In [54]:
#........Joining.........#
left=pd.DataFrame({ 'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                   index=['K0','K1','K2'])

In [60]:
right=pd.DataFrame({ 'C':['C0','C2','C3'],
                  'D':['D0','D2','D3']},
                   index=['K0','K2','K3'])

In [61]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [62]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [4]:
#-------Pandas Operation---------#

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
df=pd.DataFrame({'col1':[1,2,3,4],
                 'col2':[444,555,666,444],
                 'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
#unique of colum 2
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [8]:
#number of unique value
df['col2'].nunique()

3

In [9]:
#number of values
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [10]:
#apply build in function
def times2(x):
    return x*2

In [11]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [13]:
#insert len
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [14]:
# apply lamda expression
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [15]:
#remove column
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [16]:
#sorted by colum two
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi